Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Quarkus LRA extension is useful for building JAX-RS services that wish to definitively agree when an interaction has finished, with either a successful outcome or an unsuccessful one. In the successful case, all participants can clean up in the knowledge that all other services will do so as well. Conversely, in the unsuccessful case, participants know that each other will compensate for any actions performed during the interaction. This feature means that participating services can reach a consensus and achieve an atomic outcome.
ja_jp: QuarkusのLRAエクステンションは、インタラクションが終了したときに、成功した場合と失敗した場合のいずれかで確定的に合意したいと考えているJAX-RSサービスを構築する際に便利です。成功した場合は、すべての参加者は、他のすべてのサービスも同様に行うことを認識して、クリーンアップできます。逆に、失敗した場合は、参加者はインタラクション中に行われた行為をお互いに補償することを知っています。この機能は、参加したサービスがコンセンサスを得て、アトミックな結果を得ることができることを意味します。

source: The Quarkus Mailer is implemented on top of the https://vertx.io/docs/vertx-mail-client/java/[Vert.x Mail Client], providing an asynchronous and non-blocking way to send emails. If you need fine control on how the mail is sent, for instance if you need to retrieve the message ids, you can inject the underlying client, and use it directly:
ja_jp: Quarkus Mailerは、 link:https://vertx.io/docs/vertx-mail-client/java/[Vert.xメールクライアント] の上に実装されており、非同期でノンブロッキングな方法でメールを送信することができます。メールの送信方法を細かく制御する必要がある場合、例えばメッセージのIDを取得する必要がある場合などの場合は、基礎となるクライアントを注入して直接使用することができます。

source: The Quarkus Maven Plugin builds the Quarkus applications, and provides helpers to launch dev mode or build native executables.
ja_jp: Quarkus Mavenプラグインは、Quarkusアプリケーションをビルドし、開発モードの起動やネイティブ実行可能ファイルのビルドのためのヘルパーを提供します。

source: The Quarkus Maven Plugin builds the Quarkus applications, and provides helpers to launch dev mode or build native executables. For more information about how to use the Quarkus Maven Plugin, please refer to the xref:maven-tooling.adoc[Maven Tooling guide].
ja_jp: Quarkus Maven Pluginは、Quarkusアプリケーションをビルドし、開発モードを起動したり、ネイティブ実行可能ファイルを構築するためのヘルパーを提供します。Quarkus Maven Pluginの使用方法の詳細については、 link:maven-tooling.html[Maven Toolingガイド] を参照してください。

source: The Quarkus Maven Plugin provides a specific `quarkus` packaging that is used by default in the generated projects. This packaging should be used only for the Quarkus application itself, not for the library modules that should keep the default `jar` packaging.
ja_jp: Quarkus Maven プラグインは、生成されたプロジェクトでデフォルトで使用される特定の `quarkus` パッケージングを提供します。このパッケージングは、Quarkus アプリケーション自体にのみ使用し、デフォルトの `jar` パッケージングを維持する必要があるライブラリモジュールには使用しないでください。

source: The Quarkus Maven and Gradle plugins can still be used to manage Quarkus projects.
ja_jp: Quarkus MavenおよびGradleのプラグインは、引き続きQuarkusプロジェクトの管理に使用できます。

source: The Quarkus Maven plugin automatically generated a controller with the Spring Web annotations to define our REST endpoint (instead of the JAX-RS ones used by default). First create a `src/main/java/org/acme/spring/web/GreetingController.java`, a controller with the Spring Web annotations to define our REST endpoint, as follows:
ja_jp: Quarkus Maven プラグインは、REST エンドポイントを定義するために Spring Web アノテーションを使用してコントローラーを自動的に生成しました (デフォルトで使用される JAX-RS エンドポイントの代わりに)。まず、以下のように、REST エンドポイントを定義する Spring Web アノテーションを持つコントローラーである `src/main/java/org/acme/spring/web/GreetingController.java` を作成します。

source: The Quarkus Maven plugin automatically generated a controller with the Spring Web annotations to define our REST endpoint (instead of the Jakarta REST ones used by default). First create a `src/main/java/org/acme/spring/security/GreetingController.java`, a controller with the Spring Web annotations to define our REST endpoint, as follows:
ja_jp: Quarkus Mavenプラグインは、RESTエンドポイントを定義するためのSpring Webアノテーションを持つコントローラを自動的に生成します(デフォルトで使用されるJakarta RESTの代わりに)。まず、 RESTエンドポイントを定義するSpring Webアノテーションを持つコントローラ `src/main/java/org/acme/spring/security/GreetingController.java` を次のように作成します：

source: The Quarkus Maven plugin automatically generated a controller with the Spring Web annotations to define our REST endpoint (instead of the Jakarta REST ones used by default). First create a `src/main/java/org/acme/spring/web/GreetingController.java`, a controller with the Spring Web annotations to define our REST endpoint, as follows:
ja_jp: Quarkus Mavenプラグインは、RESTエンドポイントを定義するためのSpring Webアノテーションを持つコントローラを自動的に生成します（デフォルトで使用されるJakarta RESTの代わりに使用します）。まず、 RESTエンドポイントを定義するためのSpring Webアノテーションを持つコントローラ `src/main/java/org/acme/spring/web/GreetingController.java` を次のように作成します:

source: The Quarkus Maven plugin includes a goal called `info` (currently marked as 'experimental') that logs Quarkus-specific information about the project, such as: the imported Quarkus platform BOMs and the Quarkus extensions found among the project dependencies. In a multi-module project `quarkus:info` will assume that the current module, in which it is executed, is the main module of the application.
ja_jp: Quarkus Maven プラグインには、 `info` (現在は 'experimental' とマークされています) と呼ばれるゴールが含まれています。これは、インポートされた Quarkus プラットフォーム BOM やプロジェクトの依存関係で見つかった Quarkus エクステンションなど、プロジェクトに関する Quarkus 固有の情報をログに記録するものです。マルチモジュールプロジェクトでは、 `quarkus:info` は、実行されている現在のモジュールが、アプリケーションのメインモジュールであると想定します。

source: The Quarkus Maven plugin makes use of `javac`, and by default it picks up compiler flags to pass to `javac` from `maven-compiler-plugin`.
ja_jp: Maven プラグインは `javac` を使用し、デフォルトでは `maven-compiler-plugin` から `javac` に渡すコンパイラフラグをピックアップします。

source: The Quarkus Maven plugin version isn't currently included in the update report, however it's planned to be added in the future releases.
ja_jp: Quarkus Maven プラグインのバージョンは、現在更新レポートに含まれていませんが、将来のリリースで追加される予定です。

source: The Quarkus Maven plugin:
ja_jp: Quarkus Mavenプラグイン:

source: The Quarkus Micro Image is a small container image providing the right set of dependencies to run your native application. It is based on https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro]. This base image has been tailored to work perfectly in containers.
ja_jp: Quarkus マイクロイメージは、ネイティブアプリケーションを実行するための適切な依存関係のセットを提供する小さなコンテナイメージです。これは https://catalog.redhat.com/software/containers/ubi8-micro/601a84aadd19c7786c47c8ea?container-tabs=overview[UBI Micro] に基づいています。このベースイメージは、コンテナで完全に機能するように調整されています。

source: The Quarkus Micro Image is a small container image providing the right set of dependencies to run your native application. It is based on https://catalog.redhat.com/software/containers/ubi9-micro/61832b36dd607bfc82e66399?container-tabs=overview[UBI Micro]. This base image has been tailored to work perfectly in containers.
ja_jp: Quarkus Micro Imageは、ネイティブアプリケーションを実行するための依存関係を提供する小さなコンテナイメージです。 link:https://catalog.redhat.com/software/containers/ubi9-micro/61832b36dd607bfc82e66399?container-tabs=overview[UBI Micro] がベースになっています。 このベースイメージは、コンテナで完全に動作するように調整されています。

source: The Quarkus OpenID Connect (OIDC) extension can protect application HTTP endpoints by using the OIDC Authorization Code Flow mechanism supported by OIDC-compliant authorization servers, such as https://www.keycloak.org[Keycloak].
ja_jp: このガイドでは、Quarkus OpenID Connect (OIDC) エクステンションを使用して、 link:https://www.keycloak.org/[Keycloak] などのOpenID Connect準拠の認証サーバーでサポートされている OpenID Connect 認可コードフローを使用して Quarkus HTTP エンドポイントを保護する方法を説明します。

source: The Quarkus OpenID Connect (OIDC) extension can protect application HTTP endpoints by using the OIDC Authorization Code Flow mechanism supported by OIDC-compliant authorization servers, such as link:https://www.keycloak.org[Keycloak].
ja_jp: Quarkus OpenID Connect (OIDC) エクステンションは、link:https://www.keycloak.org[Keycloak] などの OIDC 準拠の認可サーバーでサポートされている OIDC 認可コードフローメカニズムを使用して、アプリケーション HTTP エンドポイントを保護できます。

source: The Quarkus OpenID Connect (`quarkus-oidc`) extension also supports bearer token authorization and uses `smallrye-jwt` to represent bearer tokens as `JsonWebToken`. For details, see the xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer Token Authentication] guide.
ja_jp: Quarkus の OpenID Connect (`quarkus-oidc`) エクステンションもベアラートークン認証をサポートしており、 `smallrye-jwt` を使用してベアラートークンを `JsonWebToken` として表現します。 詳細については、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証] ガイドを参照してください。

source: The Quarkus OpenTelemetry extension uses its own signal exporters built on top of Vert.x for optimal performance and maintainability.
ja_jp: Quarkus OpenTelemetry エクステンションは、Vert.x 上にビルドされた独自のシグナルエクスポーターを使用して、最適なパフォーマンスと保守性を実現します。

source: The Quarkus OpenTelemetry extension uses its own signal exporters built on top of Vert.x for optimal performance and maintainability. All *Quarkus built in exporters use the OTLP protocol* through a couple of data senders, using `grpc` (the default) and `http/protobuf`.
ja_jp: Quarkus OpenTelemetry エクステンションは、最適なパフォーマンスと保守性を実現するために、Vert.x 上に構築された独自のシグナルエクスポーターを使用します。すべての *Quarkus 組み込みエクスポーターは、OTLP プロトコル* を介して、いくつかのデータ送信者 (`grpc` (デフォルト) と `http/protobuf`) を使用します。

source: The Quarkus Platform is a curated set of extensions, tools, and configurations that make it easier to build, test, and deploy Java applications with Quarkus.
ja_jp: Quarkusプラットフォームは、QuarkusでJavaアプリケーションを構築、テスト、デプロイすることを容易にする、厳選されたエクステンション、ツール、設定のセットです。

source: The Quarkus REST endpoint security checks are performed before xref:cdi.adoc#interceptors[CDI interceptors] are invoked. The safest approach to log Quarkus Security authentication exceptions is to ensure that proactive authentication is enabled and to use Vert.x HTTP route failure handlers. For more information, see the xref:security-proactive-authentication.adoc#customize-auth-exception-responses[Customize authentication exception responses] section of the Proactive authentication guide.
ja_jp: Quarkus REST エンドポイントのセキュリティーチェックは、xref:cdi.adoc#interceptors[CDI インターセプター] が呼び出される前に実行されます。 Quarkus Security 認証例外をログに記録する最も安全な方法として、プロアクティブ認証が有効になっていることを確認し、Vert.x HTTP ルート失敗ハンドラーを使用することが挙げられます。 詳細は、プロアクティブ認証ガイドの xref:security-proactive-authentication.adoc#customize-auth-exception-responses[認証例外応答のカスタマイズ] セクションを参照してください。

source: The Quarkus REST extension is added automatically only if you ask for codestarts and you didn't specify any extensions.
ja_jp: QuarkusのRESTエクステンションは、codestartsでエクステンションを指定しなかった場合にのみ、自動的に追加されます。

source: The Quarkus REST or RESTEasy Classic context
ja_jp: Quarkus RESTまたはRESTEasy Classicのコンテキスト

source: The Quarkus Security architecture and process flow
ja_jp: Quarkus Securityのアーキテクチャとプロセスフロー

source: The Quarkus Security architecture provides several built-in authentication mechanisms and is highly customizable.
ja_jp: Quarkus Security アーキテクチャは、いくつかの組込認証メカニズムを提供し、高度にカスタマイズ可能です。

source: The Quarkus Security architecture provides several built-in authentication mechanisms and is highly customizable. The primary mechanism for securing HTTP applications in Quarkus is the `HttpAuthenticationMechanism` interface.
ja_jp: Quarkus Securityアーキテクチャは、いくつかの組込認証メカニズムを提供し、高度にカスタマイズ可能です。 QuarkusのHTTPアプリケーションを保護する主なメカニズムは、 `HttpAuthenticationMechanism` インタフェースです。

source: The Quarkus Security framework provides built-in security authentication mechanisms for Basic, Form-based, and mutual TLS (mTLS) authentication. You can also use other well-known xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[authentication mechanisms], such as OpenID Connect (OIDC) and WebAuthn.
ja_jp: Quarkusセキュリティフレームワークには、Basic認証、フォームベース認証、相互TLS（mTLS）認証の組み込み認証メカニズムが用意されています。OpenID Connect（OIDC）やWebAuthnなど、その他のよく知られた xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[認証メカニズム] を使用することもできます。

source: The Quarkus Security framework provides built-in security authentication mechanisms for Basic, Form-based, and mutual TLS (mTLS) authentication. You can also use other well-known xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[authentication mechanisms], such as OpenID Connect (OIDC) and WebAuthn. Authentication mechanisms depend on xref:security-identity-providers.adoc[Identity providers] to verify the authentication credentials and map them to a `SecurityIdentity` instance with the username, roles, original authentication credentials, and other attributes.
ja_jp: Quarkus Security フレームワークは、Basic 認証、フォームベース認証、相互 TLS (mTLS) 認証用の組み込みセキュリティー認証メカニズムを提供します。 OpenID Connect (OIDC) や WebAuthn など、他のよく知られている xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[認証メカニズム] を使用することもできます。 認証メカニズムは、xref:security-identity-providers.adoc[アイデンティティープロバイダー] に依存して認証情報を検証し、ユーザー名、ロール、元の認証情報、およびその他の属性を含む `SecurityIdentity` インスタンスに認証情報をマッピングします。

source: The Quarkus Security framework supports multiple authentication mechanisms, which can also be combined. Some supported authentication mechanisms are built into Quarkus, while others require you to add an extension.
ja_jp: Quarkusセキュリティフレームワークは、複数の認証メカニズムをサポートしており、それらを組み合わせることもできます。 サポートされている認証メカニズムの中には、Quarkusに組み込まれているものもあれば、エクステンションを追加する必要があるものもあります。

source: The Quarkus Security framework supports multiple authentication mechanisms, which you can use to secure your applications.
ja_jp: Quarkus Securityフレームワークは、複数の認証メカニズムをサポートしており、これを使用してアプリケーションを保護することができます。

source: The Quarkus Security framework supports multiple authentication mechanisms, which you can use to secure your applications. You can also combine authentication mechanisms.
ja_jp: Quarkus Security フレームワークは、複数の認証メカニズムをサポートしており、これらを使用してアプリケーションを保護することができます。 また、認証メカニズムを組み合わせることも可能です。

source: The Quarkus WebAuthn extension comes out of the box with these REST endpoints pre-defined:
ja_jp: Quarkus WebAuthnエクステンションには、これらのRESTエンドポイントがあらかじめ定義されています:

source: The Quarkus WebSocket implementation is an implementation of link:https://eclipse-ee4j.github.io/websocket-api/[Jakarta Websockets].
ja_jp: Quarkus WebSocketの実装は、 link:https://eclipse-ee4j.github.io/websocket-api/[Jakarta Websocket] の実装です。

source: The Quarkus WebSocket implementation is an implementation of link:https://jakarta.ee/specifications/websocket/[Jakarta Websockets].
ja_jp: Quarkus WebSocketの実装は、 link:https://jakarta.ee/specifications/websocket/[Jakarta Websocket] の実装の一つです。

source: The Quarkus World Tour of Java User Groups continues in 2022.
ja_jp: Quarkus World Tour of Java User Groupsは、2022年も継続します。

source: The Quarkus `quarkus-oidc` extension provides a reactive, interoperable, multitenant-enabled OIDC adapter that supports Bearer Token and Authorization Code Flow authentication mechanisms. The Bearer Token mechanism extracts the token from the HTTP Authorization header. The Authorization Code Flow mechanism redirects the user to an OIDC provider to authenticate the identity of the user. After the user is redirected back to Quarkus, the mechanism completes the authentication process by exchanging the provided code that was granted for the ID, access, and refresh tokens.
ja_jp: Quarkus `quarkus-oidc` エクステンションは、ベアラートークンと認可コードフロー認証メカニズムをサポートする、リアクティブで相互運用可能なマルチテナント対応OIDCアダプタを提供します。 Bearer Token メカニズムは、HTTP Authorization ヘッダーからトークンを抽出します。認可コードフローメカニズムは、ユーザーを OIDC プロバイダーにリダイレクトし、ユーザーの ID を認証します。ユーザーがQuarkusにリダイレクトされた後、このメカニズムは、ID、アクセス、リフレッシュトークンに対して付与されたコードを交換することで、認証プロセスを完了します。

source: The Quarkus `quarkus-oidc` extension provides a reactive, interoperable, multitenant-enabled OIDC adapter that supports Bearer token and Authorization Code Flow authentication mechanisms. The Bearer token authentication mechanism extracts the token from the HTTP Authorization header.
ja_jp: Quarkus の `quarkus-oidc` エクステンションは、ベアラートークンと認証コードフローの認証メカニズムをサポートする、リアクティブで相互運用可能なマルチテナント対応の OIDC アダプターを提供します。 Bearer トークン認証メカニズムは、HTTP Authorization ヘッダーからトークンを抽出します。

source: The Quarkus `quarkus-oidc` extension provides a reactive, interoperable, multitenant-enabled OIDC adapter that supports Bearer token and Authorization Code Flow authentication mechanisms. The Bearer token authentication mechanism extracts the token from the HTTP Authorization header. The Authorization Code Flow mechanism redirects the user to an OIDC provider to authenticate the user's identity. After the user is redirected back to Quarkus, the mechanism completes the authentication process by exchanging the provided code that was granted for the ID, access, and refresh tokens.
ja_jp: Quarkus `quarkus-oidc` エクステンションは、ベアラートークンと認可コードフロー認証メカニズムをサポートする、リアクティブで相互運用可能なマルチテナント対応OIDCアダプタを提供します。 ベアラートークン認証メカニズムは、HTTP Authorizationヘッダーからトークンを抽出します。 認可コードフロー機構は、ユーザーを OIDC プロバイダーにリダイレクトし、ユーザーの ID を認証します。 ユーザーがQuarkusにリダイレクトされた後、このメカニズムは、ID、アクセス、リフレッシュトークンに対して付与されたコードを交換することで、認証プロセスを完了します。

source: The Quarkus `smallrye-graphql` extension ships with `GraphiQL` and enables it by default in `dev` and `test` modes, but it can also be explicitly configured for `production` mode as well, by setting the `quarkus.smallrye-graphql.ui.always-include` configuration property to `true`.
ja_jp: Quarkusの `smallrye-graphql` エクステンションは、 `GraphiQL` と一緒に出荷され、 `GraphiQL` は `dev` と `test` モードでデフォルトで有効になりますが、 `quarkus.smallrye-graphql.ui.always-include` 設定プロパティを `true` に設定することで `production` モードでも明示的に有効にすることができます。

source: The Quarkus `smallrye-graphql` extension ships with `GraphiQL` and enables it by default in `dev` and `test` modes, but it can also be explicitly configured for `production` mode as well.
ja_jp: Quarkusの `smallrye-graphql` エクステンションは、 `GraphiQL` と一緒に出荷され、 `dev` と `test` モードでデフォルトで有効になりますが、 `production` モードでも明示的に設定することができます。

source: The Quarkus `smallrye-graphql` extension ships with https://github.com/graphql/graphiql/blob/main/packages/graphiql/README.md[GraphiQL] and enables it by default in `dev` and `test` modes, but it can also be explicitly configured for `production` mode as well, by setting the `quarkus.smallrye-graphql.ui.always-include` configuration property to `true`.
ja_jp: Quarkusの `smallrye-graphql` エクステンションは、 https://github.com/graphql/graphiql/blob/main/packages/graphiql/README.md[GraphiQL] と一緒に出荷され、 `dev` と `test` モードでデフォルトで有効になりますが、 `quarkus.smallrye-graphql.ui.always-include` 設定プロパティを `true` に設定することで `production` モードでも明示的に有効にすることができます。

source: The Quarkus `smallrye-health` extension ships with `health-ui` and enables it by default in dev and test modes, but it can also be explicitly configured for production mode as well.
ja_jp: Quarkusの `smallrye-health` エクステンションは、 `health-ui` を同梱しており、devおよびtestモードでデフォルトで有効になりますが、productionモードでも同様に明示的に設定することができます。

source: The Quarkus `smallrye-openapi` extension comes with a `swagger-ui` extension embedding a properly configured Swagger UI page.
ja_jp: Quarkus `smallrye-openapi` エクステンションには、適切に設定されたSwagger UIページを埋め込む `swagger-ui` エクステンションが付属しています。

source: The Quarkus application build is split across three tasks. The `quarkusBuild` task is responsible to _provide_ a built Quarkus application. The tasks `quarkusDependenciesBuild` and `quarkusAppPartsBuild` are considered internal tasks (may change at any time w/o prior notice). See below for details.
ja_jp: Quarkus アプリケーションのビルドは 3 つのタスクに分かれています。 `quarkusBuild`タスクは、ビルドされた Quarkus アプリケーションを _提供_ する役割を担っています。quarkusDependenciesBuild と quarkusAppPartsBuild のタスクは、内部タスクとみなされます (予告なく変更される可能性があります)。詳細は以下を参照してください。

source: The Quarkus application must validate that usernames, passwords, and roles are managed securely. This process, however, can introduce significant complexity to the application. Depending on the use case, other authentication mechanisms that delegate username, password, and role management to specialized services might be a better choice.
ja_jp: Quarkusアプリケーションは、ユーザー名、パスワード、およびロールが安全に管理されていることを検証する必要があります。しかし、このプロセスは、アプリケーションに大きな複雑さをもたらす可能性があります。ユースケースによっては、ユーザー名、パスワード、ロールの管理を専用のサービスに委ねる他の認証メカニズムの方が良い選択かもしれません。

source: The Quarkus application must validate that usernames, passwords, and roles are managed securely. This process, however, can introduce significant complexity to the application. Depending on the use case, other authentication mechanisms that delegate username, password, and role management to specialized services might be more secure.
ja_jp: Quarkusアプリケーションは、ユーザー名、パスワード、ロールが安全に管理されていることを検証する必要があります。 しかし、このプロセスはアプリケーションに大きな複雑さをもたらす可能性があります。 ユースケースによっては、ユーザー名、パスワード、ロールの管理を専用のサービスに委譲する他の認証メカニズムの方がより安全かもしれません。

source: The Quarkus architecture, based on non-blocking I/O and message passing, allows multiple supporting reactive development models that are all different in how they express continuations. The two main ways to write reactive code with Quarkus are:
ja_jp: ノンブロッキングI/OとメッセージパッシングをベースにしたQuarkusのアーキテクチャでは、継続性の表現方法が異なる複数のリアクティブ開発モデルをサポートしています。Quarkusでリアクティブコードを書くには、主に以下の2つの方法があります。

source: The Quarkus automatic JaCoCo config will only work for tests that are annotated with `@QuarkusTest`. If you want to check the coverage of other tests as well then you will need to fall back to the JaCoCo maven plugin.
ja_jp: Quarkusの自動Jacoco設定は、 `@QuarkusTest` でアノテーションされたテストに対してのみ機能します。他のテストのカバレッジもチェックしたい場合は、Jacoco mavenプラグインを利用する必要があります。

source: The Quarkus automatic Jacoco config will only work for tests that are annotated with `@QuarkusTest`. If you want to check the coverage of other tests as well then you will need to fall back to the Jacoco maven plugin.
ja_jp: Quarkusの自動Jacoco設定は、 `@QuarkusTest` でアノテーションされたテストに対してのみ機能します。他のテストのカバレッジもチェックしたい場合は、Jacoco mavenプラグインを利用する必要があります。

source: The Quarkus class loading architecture is slightly different depending on the mode that the application is run in.
ja_jp: Quarkusのクラスローディングアーキテクチャは、アプリケーションを実行するモードによって若干異なります。

source: The Quarkus class loading architecture is slightly different depending on the mode that the application is run in. When running a production application everything is loaded in the system ClassLoader, so it is a completely flat class path. This also applies to native image mode which does not really support multiple ClassLoaders, and is based on a normal production Quarkus application.
ja_jp: Quarkus のクラスロードアーキテクチャは、アプリケーションを実行するモードによって若干異なります。本番環境のアプリケーションを実行しているときは、すべてがシステム ClassLoader でロードされるため、完全にフラットなクラスパスとなります。これは、複数の ClassLoader をサポートしていないネイティブイメージモードにも当てはまり、通常のプロダクション Quarkus アプリケーションをベースにしています。

source: The Quarkus command line tool lets you create projects, manage extensions and perform essential build and dev commands.
ja_jp: Quarkusのコマンドラインツールでは、プロジェクトの作成、エクステンションの管理、ビルドや開発の必須コマンドの実行が可能です。

source: The Quarkus community are localizing the quarkus.io website in multiple languages.
ja_jp: Quarkusコミュニティは、quarkus.ioのウェブサイトを多言語でローカライズしています。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[1153 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[1153名の貢献者] がいます。各貢献者の皆様に深く感謝いたします。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[1163 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkus コミュニティは成長しており、現在 https://github.com/quarkusio/quarkus/graphs/contributors[1163 名の貢献者] がいます。皆様に心より感謝申し上げます。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[1173 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkus コミュニティーは成長しており、現在 https://github.com/quarkusio/quarkus/graphs/contributors[1173 人の貢献者] がいます。 貢献者全員に心から感謝いたします。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[356 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkusコミュニティは成長を続けており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[356人の貢献者] がいます。一人ひとりの貢献者に多くの感謝の意を表します。

source: The Quarkus community is growing and has now https://github.com/quarkusio/quarkus/graphs/contributors[378 contributors]. Many many thanks to each and everyone of them.
ja_jp: Quarkus コミュニティは成長しており、現在 link:https://github.com/quarkusio/quarkus/graphs/contributors[378人のコントリビューター] がいます。一人一人に多くの感謝の意を表します。
